---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.EllipseFocusMrkVisible
source: html/b4299a3d-c0c8-b30f-b3ef-b5dab3454893.htm
---
# Autodesk.Revit.DB.ParameterTypeId.EllipseFocusMrkVisible Property

"Focus Marks Visible"

## Syntax (C#)
```csharp
public static ForgeTypeId EllipseFocusMrkVisible { get; }
```